ruby/Z.html
<!DOCTYPE html>
<html>
<head>
<title>Z</title>
<!-- 2018-05-22 Tue 22:11 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Z</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Zealot</a></li>
<li><a href="#sec-2">2. Zenith</a></li>
<li><a href="#sec-3">3. Zephyr</a></li>
<li><a href="#sec-4">4. Zest</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Zealot</a></li>
<li><a href="#sec-2">2. Zenith</a></li>
<li><a href="#sec-3">3. Zephyr</a></li>
<li><a href="#sec-4">4. Zest</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-05-22 22:11:27</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/zealot-in-a-sentence/">Zealot</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>one who is uncompromising and fanatical in pursuit of his ideals</code>
</p>

<ul class="org-ul">
<li>The religious zealot was willing to break the law to follow his prophet’s orders.
</li>
<li>When the zealot wrote his memoir, he wrote that he fought all of his wars for his god.
</li>
<li>The security camera caught the health zealot vandalizing the soft drink manufacturer’s office.
</li>
<li>When the fitness zealot learned a tobacco shop was moving next door to his gym, he decided to picket the shop’s corporate office.
</li>
<li>While Jacob was once a skeptic of the religion, he is now a zealot who divorced his wife so he could be reborn in the church.
</li>
<li>Some people call Peter a zealot because of the lengths he goes to in order to keep technology out of his home.
</li>
<li>During the middle of the night, a pro-life zealot bombed the abortion clinic and killed two nurses who were working late.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/zenith-in-a-sentence/">Zenith</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>the strongest or most successful period of time</code>
</p>

<ul class="org-ul">
<li>Before her zenith ended, Meredith published six best-selling books.
</li>
<li>Mike’s second promotion in eleven months confirms he is at the zenith of his career.
</li>
<li>The singer reached her zenith when she sold over twelve million records in 2013.
</li>
<li>At the zenith, the two planets will fully align because of the strong magnetic pull between them.
</li>
<li>After the president brought an end to the war, his popularity hit its zenith.
</li>
<li>Marie’s academic zenith was her senior year in high school when her lowest grade was a ninety-four.
</li>
<li>Since my energy is at its zenith in the morning, I prefer to get my larger tasks completed at the start of the day.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/zephyr-in-a-sentence/">Zephyr</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>a light or delicate wind</code>
</p>

<ul class="org-ul">
<li>By evening, the harsh wind following the storm had turned into a zephyr that did nothing more than move the leaves.
</li>
<li>Before Sarah went to bed, she opened the window to feel the zephyr as she slept.
</li>
<li>The zephyr did very little to cool us off as we sat on the hot porch.
</li>
<li>With only a zephyr in the air, it is not surprising we came in last in the sailboat race.
</li>
<li>The zephyr carried the scent of the sweet smelling flowers to Cate’s nose.
</li>
<li>When the heavy winds eased to a zephyr, I knew it was going to be a great day for a picnic.
</li>
<li>While we were prepared for fierce winds, the hurricane dissolved and gave us only the smallest zephyr.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/zest-in-a-sentence/">Zest</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>a great amount of enthusiasm</code>
</p>

<ul class="org-ul">
<li>Kate's zest for running keeps her very active.
</li>
<li>Because I have a fear of heights, I do not have a zest for flying.
</li>
<li>My teacher’s zest for math makes class fun and exciting for everyone.
</li>
<li>At the age of eighty, my grandmother has a zest for life that allows her to live like a carefree teenager.
</li>
</ul>





<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>